ch2/ch2-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-16 Thu 09:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 2.1</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="pedh" />
<link rel="stylesheet" type="text/css" href="/css/org-info.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/CLRS-Solutions"> UP </a>
 |
 <a accesskey="H" href="/CLRS-Solutions"> HOME </a>
</div><div id="content">
<h1 class="title">Chapter 2.1</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org75acaaf">ch2.1</a>
<ul>
<li><a href="#org70b4f71">2.1-1</a></li>
<li><a href="#org5816fec">2.1-2</a></li>
<li><a href="#orgd43191d">2.1-3</a></li>
<li><a href="#org8a90558">2.1-4</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org75acaaf" class="outline-2">
<h2 id="org75acaaf">ch2.1</h2>
<div class="outline-text-2" id="text-org75acaaf">
</div>
<div id="outline-container-org70b4f71" class="outline-3">
<h3 id="org70b4f71">2.1-1</h3>
<div class="outline-text-3" id="text-org70b4f71">
<p>
(a)
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">31</td>
<td class="org-left"><b>41</b></td>
<td class="org-right">59</td>
<td class="org-right">26</td>
<td class="org-right">41</td>
<td class="org-right">58</td>
</tr>
</tbody>
</table>
<p>
(b)
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">31</td>
<td class="org-right">41</td>
<td class="org-left"><b>59</b></td>
<td class="org-right">26</td>
<td class="org-right">41</td>
<td class="org-right">58</td>
</tr>
</tbody>
</table>
<p>
(c)
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">31</td>
<td class="org-right">41</td>
<td class="org-right">59</td>
<td class="org-left"><b>26</b></td>
<td class="org-right">41</td>
<td class="org-right">58</td>
</tr>
</tbody>
</table>
<p>
(d)
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">26</td>
<td class="org-right">31</td>
<td class="org-right">41</td>
<td class="org-right">59</td>
<td class="org-left"><b>41</b></td>
<td class="org-right">58</td>
</tr>
</tbody>
</table>
<p>
(e)
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">26</td>
<td class="org-right">31</td>
<td class="org-right">41</td>
<td class="org-right">41</td>
<td class="org-right">59</td>
<td class="org-left"><b>58</b></td>
</tr>
</tbody>
</table>
<p>
(f)
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">26</td>
<td class="org-right">31</td>
<td class="org-right">41</td>
<td class="org-right">41</td>
<td class="org-right">58</td>
<td class="org-right">59</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org5816fec" class="outline-3">
<h3 id="org5816fec">2.1-2</h3>
<div class="outline-text-3" id="text-org5816fec">
<pre class="example">
INSERTION-SORT(A)
    for j = 2 to A.length
    key = A[j]
    // Insert A[j] into the sorted sequence A[1..j - 1].
    i = j - 1
    while i &gt; 0 and A[i] &lt; key
	A[i + 1] = A[i]
	i = i - 1
    A[i + 1] = key
</pre>
</div>
</div>
<div id="outline-container-orgd43191d" class="outline-3">
<h3 id="orgd43191d">2.1-3</h3>
<div class="outline-text-3" id="text-orgd43191d">
<pre class="example">
LINEAR-SEARCH(A, v)
    for i = 1 to A.length
	if A[i] == v:
	    return i
    return NIL
</pre>

<p>
<b>Loop Invariant:</b> At the start of each iteration, the elements in subarray
A[1..i - 1] are all different from v.
</p>

<p>
<b>Initialization:</b> The subarray A[1..i - 1] is empty.
</p>

<p>
<b>Maintenance:</b> If A[i] equals v, we return i, else the elements in A[1..i]
are all different with v, we increase i for the next iteration.
</p>

<p>
<b>Termination:</b> We terminate at i which A[i] equals v and return i, or we
terminate at i &gt; A.length, i.e. v does not appear in A, then we return NIL.
</p>
</div>
</div>

<div id="outline-container-org8a90558" class="outline-3">
<h3 id="org8a90558">2.1-4</h3>
<div class="outline-text-3" id="text-org8a90558">
<p>
<b>Input:</b> Two n-element arrays A and B, each stands for a n-bit binary
integers. Higher bit stores at larger index.
</p>

<p>
<b>Output:</b> The sum of the two input integers, stores in (n + 1)-element
array C.
</p>
<pre class="example">
BINARY-INTEGER-ADD(A, B)
    n = A.length
    C = empty (n + 1)-element array
    carry = 0
    for i = 1 to n
	C[i] = (A[i] + B[i] + carry) % 2
	carry = (A[i] + B[i] + carry) // 2
    C[n + 1] = carry
    return C
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pedh</p>
<p class="date">Created: 2020-04-16 Thu 09:19</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
